-- Let us take care of exercises related to filtering and aggregations using SQL.

-- * Get all the details of the courses which are in `inactive` or `draft` state.

-- * Get all the details of the courses which are related to `Python` or `Scala`.

-- * Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.

-- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.

-- * Get all the details of `Python` or `Scala` related courses in `draft` status.

-- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

# 93. Simple Exercises for Filtering and Aggregations

In [3]:
%%sql
SELECT * FROM courses;

,course_id,course_name,course_author,course_status,course_published_dt
0,1,Programming using Python,Bob Dillon,published,2020-09-30
1,2,Data Engineering using Python,Bob Dillon,published,2020-07-15
2,3,Data Engineering using Scala,Elvis Presley,draft,NaN
3,4,Programming using Scala,Elvis Presley,published,2020-05-12
4,5,Programming using Java,Mike Jack,inactive,2020-08-10
5,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
6,7,Web Applications - Java Spring,Bob Dillon,draft,NaN
7,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
8,9,Streaming Pipelines - Python,Bob Dillon,published,2020-10-05
9,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30
10,11,Web Applications - Python Django,Bob Dillon,published,2020-06-23
11,12,Server Automation - Ansible,Uncle Sam,published,2020-07-05

# Get all the details of the courses which are in `inactive` or `draft` state.

In [5]:
%%sql
SELECT * FROM courses
WHERE course_status IN ('draft', 'inactive')

,course_id,course_name,course_author,course_status,course_published_dt
0,3,Data Engineering using Scala,Elvis Presley,draft,NaN
1,5,Programming using Java,Mike Jack,inactive,2020-08-10
2,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
3,7,Web Applications - Java Spring,Bob Dillon,draft,NaN
4,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
5,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30

# Get all the details of the courses which are related to `Python` or `Scala`.

In [13]:
%%sql
SELECT * FROM courses
WHERE course_name LIKE '%Scala%'
   OR course_name LIKE '%Python%'

,course_id,course_name,course_author,course_status,course_published_dt
0,1,Programming using Python,Bob Dillon,published,2020-09-30
1,2,Data Engineering using Python,Bob Dillon,published,2020-07-15
2,3,Data Engineering using Scala,Elvis Presley,draft,NaN
3,4,Programming using Scala,Elvis Presley,published,2020-05-12
4,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
5,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
6,9,Streaming Pipelines - Python,Bob Dillon,published,2020-10-05
7,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30
8,11,Web Applications - Python Django,Bob Dillon,published,2020-06-23

# Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.

In [15]:
%%sql
SELECT course_status, count(*) FROM courses
GROUP BY course_status;

  course_status  count
0     published      6
1      inactive      3
2         draft      3

# Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.

In [18]:
%%sql
SELECT  course_author, count(*) FROM courses
WHERE course_status = 'published'
GROUP BY course_author;

   course_author  count
0     Bob Dillon      4
1  Elvis Presley      1
2      Uncle Sam      1

# Get all the details of `Python` or `Scala` related courses in `draft` status.

In [21]:
%%sql
SELECT * FROM courses
WHERE (course_name LIKE '%Scala%'
  OR course_name LIKE '%Python%')
  AND course_status = 'draft'

,course_id,course_name,course_author,course_status,course_published_dt
0,3,Data Engineering using Scala,Elvis Presley,draft,NaN
1,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN

# Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

In [23]:
%%sql
SELECT courses.course_author, count(*)
FROM courses
GROUP BY course_author
HAVING count(*) > 1;

   course_author  count
0     Bob Dillon      7
1  Elvis Presley      3

# # 94. Exercises on Joins and Aggregations using SQL

# Exercise 1 - Customer order count

In [13]:
%%sql
SELECT customer_id,
       customer_fname,
       customer_lname,
       count(*)
FROM customers c
    JOIN orders o
      ON c.customer_id = o.order_customer_id
        WHERE to_char(order_date, 'yyyy-mm') = '2014-01'
        GROUP BY to_char(order_date, 'yyyy-mm'), customer_id
        ORDER BY customer_id DESC;

      customer_id customer_fname customer_lname  count
0           12432         Angela          Smith      1
1           12431           Mary           Rios      4
2           12430         Hannah          Brown      1
3           12427           Mary          Smith      1
4           12426         Jordan         Valdez      1
...           ...            ...            ...    ...
4691           15           Jane           Luna      1
4692           14      Katherine          Smith      1
4693           13           Mary        Baldwin      1
4694            8          Megan          Smith      2
4695            7        Melissa         Wilcox      4

[4696 rows x 4 columns]

# Exercise 2 - Dormant Customers

In [19]:
%%sql
SELECT c.*
FROM customers c
    LEFT JOIN orders o
      ON c.customer_id = o.order_customer_id
      AND to_char(order_date, 'yyyy-mm') = '2014-01'
      WHERE o.order_customer_id IS NULL
      ORDER BY c.customer_id;

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
7734,12428,Jeffrey,Travis,XXXXXXXXX,XXXXXXXXX,1552 Burning Dale Highlands,Caguas,PR,725
7735,12429,Mary,Smith,XXXXXXXXX,XXXXXXXXX,92 Sunny Bear Villas,Gardena,CA,90247
7736,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
7737,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
7738,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

# # Exercise 3 - Revenue Per Customer

In [4]:
%%sql
SELECT
    c.customer_id,
    c.customer_fname,
    c.customer_lname,
    COALESCE(SUM(oi.order_item_quantity * oi.order_item_product_price), 0) AS customer_revenue
FROM
    customers c
LEFT JOIN
    orders o ON c.customer_id = o.order_customer_id
LEFT JOIN
    order_items oi ON o.order_id = oi.order_item_order_id
WHERE
    o.order_status IN ('COMPLETE', 'CLOSED') AND
    TO_CHAR(o.order_date, 'YYYY-MM') = '2014-01'
GROUP BY
    c.customer_id, c.customer_fname, c.customer_lname
ORDER BY
    customer_revenue DESC, c.customer_id ASC;

      customer_id customer_fname customer_lname  customer_revenue
0            2555           Mary           Long           2954.63
1            3465           Mary        Gardner           2929.74
2            3710         Ashley          Smith           2739.82
3            1780          Larry          Sharp           2689.65
4             986      Catherine        Hawkins           2629.90
...           ...            ...            ...               ...
2295        12168      Christine         Guerra              0.00
2296        12253           Mary           Chan              0.00
2297        12364           Judy          Smith              0.00
2298        12374        Frances          Smith              0.00
2299        12383          Joyce       Phillips              0.00

[2300 rows x 4 columns]

# Exercise 4 - Revenue Per Category

In [13]:
%%sql
SELECT
    c.*,
    COALESCE(SUM(oi.order_item_quantity * oi.order_item_product_price), 0) AS category_revenue
FROM
    categories AS c
LEFT JOIN
    products AS p ON c.category_id = p.product_category_id
LEFT JOIN
    order_items oi ON p.product_id = oi.order_item_product_id
LEFT JOIN
    orders AS o ON o.order_id = oi.order_item_order_id
WHERE
    TO_CHAR(o.order_date, 'YYYY-MM') = '2014-01'
    AND o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY
    c.category_id, c.category_name, c.category_department_id
ORDER BY
    c.category_id;

,category_id,category_department_id,category_name,category_revenue
0,2,2,Soccer,1094.88
1,3,2,Baseball & Softball,3214.41
2,4,2,Basketball,1299.98
3,5,2,Lacrosse,1299.69
4,6,2,Tennis & Racquet,1124.75
5,7,2,Hockey,1433.00
6,9,3,Cardio Equipment,133156.77
7,10,3,Strength Training,3388.96
8,11,3,Fitness Accessories,1509.73
9,12,3,Boxing & MMA,3998.46
10,13,3,Electronics,4074.83
11,16,3,As Seen on TV!,399.96
12,17,4,Cleats,152374.72
13,18,4,Men's Footwear,107631.72
14,24,5,Women's Apparel,114800.00
15,26,5,Girls' Apparel,6564.85
16,29,5,Shop By Sport,40090.24
17,30,6,Men's Golf Clubs,1974.83
18,31,6,Women's Golf Clubs,279.97
19,32,6,Golf Apparel,1299.67
20,33,6,Golf Shoes,4869.00
21,34,6,Golf Bags & Carts,509.97
22,35,6,Golf Gloves,3994.07
23,36,6,Golf Balls,2754.44
24,37,6,Electronics,9261.72
25,38,6,Kids' Golf Clubs,6416.55
26,40,6,Accessories,4423.23
27,41,6,Trade-In,2364.96
28,43,7,Camping & Hiking,148190.12
29,44,7,Hunting & Shooting,1784.61
30,45,7,Fishing,250787.46
31,46,7,Indoor/Outdoor Games,100309.86
32,48,7,Water Sports,113544.33

# Exercise 5 - Product Count Per Department

In [20]:
%%sql
SELECT
    d.*,
    COUNT(p.product_id) AS product_count
FROM
    departments AS d
LEFT JOIN
    categories AS c ON  d.department_id = c.category_department_id
LEFT JOIN
    products AS p ON p.product_category_id = c.category_id
GROUP BY
    d.department_name, d.department_id
ORDER BY d.department_id;

   department_id department_name  product_count
0              2         Fitness            168
1              3        Footwear            168
2              4         Apparel            140
3              5            Golf            120
4              6        Outdoors            336
5              7        Fan Shop            149